HaimYosefHaim/pow/v3.1/platform/Device/SiliconLabs/EFM32PG23/Include/efm32pg23a100f256gm48.h
/** Part number */

/* If part number is not defined as compiler option, define it */
#if !defined(EFM32PG23A100F256GM48)
#define EFM32PG23A100F256GM48    1 /**< FULL Part */
#endif

/** Configure part number */
#define PART_NUMBER                              "EFM32PG23A100F256GM48" /**< Part Number */

/** Family / Line / Series / Config */
#define _EFM32_PEARL_FAMILY                      1                                 /** Device Family Name Identifier */
#define _EFM32_PG_FAMILY                         1                                 /** Device Family Identifier */
#define _EFM_DEVICE                              1                                 /** Product Line Identifier */
#define _SILICON_LABS_32B_SERIES_2                                                 /** Product Series Identifier */
#define _SILICON_LABS_32B_SERIES                 2                                 /** Product Series Identifier */
#define _SILICON_LABS_32B_SERIES_2_CONFIG_3                                        /** Product Config Identifier */
#define _SILICON_LABS_32B_SERIES_2_CONFIG        3                                 /** Product Config Identifier */
#define _SILICON_LABS_GECKO_INTERNAL_SDID        210                               /** Silicon Labs internal use only */
#define _SILICON_LABS_GECKO_INTERNAL_SDID_210                                      /** Silicon Labs internal use only */
#define _SILICON_LABS_SECURITY_FEATURE_SE        0                                 /** Secure Elemet */
#define _SILICON_LABS_SECURITY_FEATURE_VAULT     1                                 /** Vault */
#define _SILICON_LABS_SECURITY_FEATURE_ROT       2                                 /** Root of Trust */
#define _SILICON_LABS_SECURITY_FEATURE           _SILICON_LABS_SECURITY_FEATURE_SE /** Security feature set */
#define _SILICON_LABS_EFR32_RADIO_NONE           0                                 /** No radio present */
#define _SILICON_LABS_EFR32_RADIO_SUBGHZ         1                                 /** Radio supports Sub-GHz */
#define _SILICON_LABS_EFR32_RADIO_2G4HZ          2                                 /** Radio supports 2.4 GHz */
#define _SILICON_LABS_EFR32_RADIO_DUALBAND       3                                 /** Radio supports dual band */
#define _SILICON_LABS_EFR32_RADIO_TYPE           _SILICON_LABS_EFR32_RADIO_NONE    /** Radio type */

/** Memory Base addresses and limits */
#define FLASH_MEM_BASE                           (0x08000000UL) /** FLASH_MEM base address */
#define FLASH_MEM_SIZE                           (0x00080000UL) /** FLASH_MEM avaliable address space */
#define FLASH_MEM_END                            (0x0807FFFFUL) /** FLASH_MEM end address */
#define FLASH_MEM_BITS                           (0x14UL)       /** FLASH_MEM used bits */
#define MSC_FLASH_MEM_BASE                       (0x08000000UL) /** MSC_FLASH_MEM base address */
#define MSC_FLASH_MEM_SIZE                       (0x00080000UL) /** MSC_FLASH_MEM avaliable address space */
#define MSC_FLASH_MEM_END                        (0x0807FFFFUL) /** MSC_FLASH_MEM end address */
#define MSC_FLASH_MEM_BITS                       (0x14UL)       /** MSC_FLASH_MEM used bits */
#define MSC_FLASH_USERDATA_MEM_BASE              (0x0FE00000UL) /** MSC_FLASH_USERDATA_MEM base address */
#define MSC_FLASH_USERDATA_MEM_SIZE              (0x00000400UL) /** MSC_FLASH_USERDATA_MEM avaliable address space */
#define MSC_FLASH_USERDATA_MEM_END               (0x0FE003FFUL) /** MSC_FLASH_USERDATA_MEM end address */
#define MSC_FLASH_USERDATA_MEM_BITS              (0xBUL)        /** MSC_FLASH_USERDATA_MEM used bits */
#define USERDATA_BASE                            (0x0FE00000UL) /** USERDATA base address */
#define USERDATA_SIZE                            (0x00000400UL) /** USERDATA avaliable address space */
#define USERDATA_END                             (0x0FE003FFUL) /** USERDATA end address */
#define USERDATA_BITS                            (0xBUL)        /** USERDATA used bits */
#define MSC_FLASH_CHIPCONFIG_MEM_BASE            (0x0FE08400UL) /** MSC_FLASH_CHIPCONFIG_MEM base address */
#define MSC_FLASH_CHIPCONFIG_MEM_SIZE            (0x00000600UL) /** MSC_FLASH_CHIPCONFIG_MEM avaliable address space */
#define MSC_FLASH_CHIPCONFIG_MEM_END             (0x0FE089FFUL) /** MSC_FLASH_CHIPCONFIG_MEM end address */
#define MSC_FLASH_CHIPCONFIG_MEM_BITS            (0xBUL)        /** MSC_FLASH_CHIPCONFIG_MEM used bits */
#define DMEM_RAM0_RAM_MEM_BASE                   (0x20000000UL) /** DMEM_RAM0_RAM_MEM base address */
#define DMEM_RAM0_RAM_MEM_SIZE                   (0x00010000UL) /** DMEM_RAM0_RAM_MEM avaliable address space */
#define DMEM_RAM0_RAM_MEM_END                    (0x2000FFFFUL) /** DMEM_RAM0_RAM_MEM end address */
#define DMEM_RAM0_RAM_MEM_BITS                   (0x11UL)       /** DMEM_RAM0_RAM_MEM used bits */
#define RAM_MEM_BASE                             (0x20000000UL) /** RAM_MEM base address */
#define RAM_MEM_SIZE                             (0x00010000UL) /** RAM_MEM avaliable address space */
#define RAM_MEM_END                              (0x2000FFFFUL) /** RAM_MEM end address */
#define RAM_MEM_BITS                             (0x11UL)       /** RAM_MEM used bits */

/** Flash and SRAM limits for EFM32PG23A100F256GM48 */
#define FLASH_BASE                               (0x08000000UL) /**< Flash Base Address */
#define FLASH_SIZE                               (0x00040000UL) /**< Available Flash Memory */
#define FLASH_PAGE_SIZE                          (0x00002000UL) /**< Flash Memory page size */
#define SRAM_BASE                                (0x20000000UL) /**< SRAM Base Address */
#define SRAM_SIZE                                (0x00008000UL) /**< Available SRAM Memory */
#define DMA_CHAN_COUNT                           LDMA_CH_NUM    /**< Number of DMA channels */
#define EXT_IRQ_COUNT                            76             /**< Number of External (NVIC) interrupts */

/* GPIO Avalibility Info */
#define GPIO_PA_INDEX                            0U         /**< Index of port PA */
#define GPIO_PA_COUNT                            9U         /**< Number of pins on port PA */
#define GPIO_PA_MASK                             (0x01FFUL) /**< Port PA pin mask */
#define GPIO_PA_PIN0                             1U         /**< GPIO pin PA0 is present. */
#define GPIO_PA_PIN1                             1U         /**< GPIO pin PA1 is present. */
#define GPIO_PA_PIN2                             1U         /**< GPIO pin PA2 is present. */
#define GPIO_PA_PIN3                             1U         /**< GPIO pin PA3 is present. */
#define GPIO_PA_PIN4                             1U         /**< GPIO pin PA4 is present. */
#define GPIO_PA_PIN5                             1U         /**< GPIO pin PA5 is present. */
#define GPIO_PA_PIN6                             1U         /**< GPIO pin PA6 is present. */
#define GPIO_PA_PIN7                             1U         /**< GPIO pin PA7 is present. */
#define GPIO_PA_PIN8                             1U         /**< GPIO pin PA8 is present. */
#define GPIO_PB_INDEX                            1U         /**< Index of port PB */
#define GPIO_PB_COUNT                            7U         /**< Number of pins on port PB */
#define GPIO_PB_MASK                             (0x007FUL) /**< Port PB pin mask */
#define GPIO_PB_PIN0                             1U         /**< GPIO pin PB0 is present. */
#define GPIO_PB_PIN1                             1U         /**< GPIO pin PB1 is present. */
#define GPIO_PB_PIN2                             1U         /**< GPIO pin PB2 is present. */
#define GPIO_PB_PIN3                             1U         /**< GPIO pin PB3 is present. */
#define GPIO_PB_PIN4                             1U         /**< GPIO pin PB4 is present. */
#define GPIO_PB_PIN5                             1U         /**< GPIO pin PB5 is present. */
#define GPIO_PB_PIN6                             1U         /**< GPIO pin PB6 is present. */
#define GPIO_PC_INDEX                            2U         /**< Index of port PC */
#define GPIO_PC_COUNT                            10U        /**< Number of pins on port PC */
#define GPIO_PC_MASK                             (0x03FFUL) /**< Port PC pin mask */
#define GPIO_PC_PIN0                             1U         /**< GPIO pin PC0 is present. */
#define GPIO_PC_PIN1                             1U         /**< GPIO pin PC1 is present. */
#define GPIO_PC_PIN2                             1U         /**< GPIO pin PC2 is present. */
#define GPIO_PC_PIN3                             1U         /**< GPIO pin PC3 is present. */
#define GPIO_PC_PIN4                             1U         /**< GPIO pin PC4 is present. */
#define GPIO_PC_PIN5                             1U         /**< GPIO pin PC5 is present. */
#define GPIO_PC_PIN6                             1U         /**< GPIO pin PC6 is present. */
#define GPIO_PC_PIN7                             1U         /**< GPIO pin PC7 is present. */
#define GPIO_PC_PIN8                             1U         /**< GPIO pin PC8 is present. */
#define GPIO_PC_PIN9                             1U         /**< GPIO pin PC9 is present. */
#define GPIO_PD_INDEX                            3U         /**< Index of port PD */
#define GPIO_PD_COUNT                            6U         /**< Number of pins on port PD */
#define GPIO_PD_MASK                             (0x003FUL) /**< Port PD pin mask */
#define GPIO_PD_PIN0                             1U         /**< GPIO pin PD0 is present. */
#define GPIO_PD_PIN1                             1U         /**< GPIO pin PD1 is present. */
#define GPIO_PD_PIN2                             1U         /**< GPIO pin PD2 is present. */
#define GPIO_PD_PIN3                             1U         /**< GPIO pin PD3 is present. */
#define GPIO_PD_PIN4                             1U         /**< GPIO pin PD4 is present. */
#define GPIO_PD_PIN5                             1U         /**< GPIO pin PD5 is present. */

/* Fixed Resource Locations */
#define GPIO_SWCLK_PORT                          GPIO_PA_INDEX /**< Port of SWCLK.*/
#define GPIO_SWCLK_PIN                           1U            /**< Pin of SWCLK.*/
#define GPIO_SWDIO_PORT                          GPIO_PA_INDEX /**< Port of SWDIO.*/
#define GPIO_SWDIO_PIN                           2U            /**< Pin of SWDIO.*/
#define GPIO_SWV_PORT                            GPIO_PA_INDEX /**< Port of SWV.*/
#define GPIO_SWV_PIN                             3U            /**< Pin of SWV.*/
#define GPIO_TDI_PORT                            GPIO_PA_INDEX /**< Port of TDI.*/
#define GPIO_TDI_PIN                             4U            /**< Pin of TDI.*/
#define GPIO_TDO_PORT                            GPIO_PA_INDEX /**< Port of TDO.*/
#define GPIO_TDO_PIN                             3U            /**< Pin of TDO.*/
#define GPIO_TRACECLK_PORT                       GPIO_PA_INDEX /**< Port of TRACECLK.*/
#define GPIO_TRACECLK_PIN                        4U            /**< Pin of TRACECLK.*/
#define GPIO_TRACEDATA0_PORT                     GPIO_PA_INDEX /**< Port of TRACEDATA0.*/
#define GPIO_TRACEDATA0_PIN                      3U            /**< Pin of TRACEDATA0.*/
#define GPIO_TRACEDATA1_PORT                     GPIO_PA_INDEX /**< Port of TRACEDATA1.*/
#define GPIO_TRACEDATA1_PIN                      5U            /**< Pin of TRACEDATA1.*/
#define GPIO_TRACEDATA2_PORT                     GPIO_PA_INDEX /**< Port of TRACEDATA2.*/
#define GPIO_TRACEDATA2_PIN                      6U            /**< Pin of TRACEDATA2.*/
#define GPIO_TRACEDATA3_PORT                     GPIO_PA_INDEX /**< Port of TRACEDATA3.*/
#define GPIO_TRACEDATA3_PIN                      7U            /**< Pin of TRACEDATA3.*/
#define GPIO_EM4WU0_PORT                         GPIO_PA_INDEX /**< Port of EM4WU0.*/
#define GPIO_EM4WU0_PIN                          5U            /**< Pin of EM4WU0.*/
#define GPIO_EM4WU10_PORT                        GPIO_PD_INDEX /**< Port of EM4WU10.*/
#define GPIO_EM4WU10_PIN                         5U            /**< Pin of EM4WU10.*/
#define GPIO_EM4WU3_PORT                         GPIO_PB_INDEX /**< Port of EM4WU3.*/
#define GPIO_EM4WU3_PIN                          1U            /**< Pin of EM4WU3.*/
#define GPIO_EM4WU4_PORT                         GPIO_PB_INDEX /**< Port of EM4WU4.*/
#define GPIO_EM4WU4_PIN                          3U            /**< Pin of EM4WU4.*/
#define GPIO_EM4WU6_PORT                         GPIO_PC_INDEX /**< Port of EM4WU6.*/
#define GPIO_EM4WU6_PIN                          0U            /**< Pin of EM4WU6.*/
#define GPIO_EM4WU7_PORT                         GPIO_PC_INDEX /**< Port of EM4WU7.*/
#define GPIO_EM4WU7_PIN                          5U            /**< Pin of EM4WU7.*/
#define GPIO_EM4WU8_PORT                         GPIO_PC_INDEX /**< Port of EM4WU8.*/
#define GPIO_EM4WU8_PIN                          7U            /**< Pin of EM4WU8.*/
#define GPIO_EM4WU9_PORT                         GPIO_PD_INDEX /**< Port of EM4WU9.*/
#define GPIO_EM4WU9_PIN                          2U            /**< Pin of EM4WU9.*/
#define LCD_COM0_PORT                            GPIO_PD_INDEX /**< Port of COM0.*/
#define LCD_COM0_PIN                             2U            /**< Pin of COM0.*/
#define LCD_COM1_PORT                            GPIO_PD_INDEX /**< Port of COM1.*/
#define LCD_COM1_PIN                             3U            /**< Pin of COM1.*/
#define LCD_COM2_PORT                            GPIO_PD_INDEX /**< Port of COM2.*/
#define LCD_COM2_PIN                             4U            /**< Pin of COM2.*/
#define LCD_COM3_PORT                            GPIO_PD_INDEX /**< Port of COM3.*/
#define LCD_COM3_PIN                             5U            /**< Pin of COM3.*/
#define LCD_LCD_CP_PORT                          GPIO_PA_INDEX /**< Port of LCD_CP.*/
#define LCD_LCD_CP_PIN                           6U            /**< Pin of LCD_CP.*/
#define LCD_SEG0_PORT                            GPIO_PC_INDEX /**< Port of SEG0.*/
#define LCD_SEG0_PIN                             0U            /**< Pin of SEG0.*/
#define LCD_SEG1_PORT                            GPIO_PC_INDEX /**< Port of SEG1.*/
#define LCD_SEG1_PIN                             1U            /**< Pin of SEG1.*/
#define LCD_SEG10_PORT                           GPIO_PA_INDEX /**< Port of SEG10.*/
#define LCD_SEG10_PIN                            4U            /**< Pin of SEG10.*/
#define LCD_SEG11_PORT                           GPIO_PA_INDEX /**< Port of SEG11.*/
#define LCD_SEG11_PIN                            5U            /**< Pin of SEG11.*/
#define LCD_SEG12_PORT                           GPIO_PA_INDEX /**< Port of SEG12.*/
#define LCD_SEG12_PIN                            7U            /**< Pin of SEG12.*/
#define LCD_SEG13_PORT                           GPIO_PA_INDEX /**< Port of SEG13.*/
#define LCD_SEG13_PIN                            8U            /**< Pin of SEG13.*/
#define LCD_SEG14_PORT                           GPIO_PB_INDEX /**< Port of SEG14.*/
#define LCD_SEG14_PIN                            0U            /**< Pin of SEG14.*/
#define LCD_SEG15_PORT                           GPIO_PB_INDEX /**< Port of SEG15.*/
#define LCD_SEG15_PIN                            1U            /**< Pin of SEG15.*/
#define LCD_SEG16_PORT                           GPIO_PB_INDEX /**< Port of SEG16.*/
#define LCD_SEG16_PIN                            2U            /**< Pin of SEG16.*/
#define LCD_SEG17_PORT                           GPIO_PB_INDEX /**< Port of SEG17.*/
#define LCD_SEG17_PIN                            3U            /**< Pin of SEG17.*/
#define LCD_SEG18_PORT                           GPIO_PC_INDEX /**< Port of SEG18.*/
#define LCD_SEG18_PIN                            8U            /**< Pin of SEG18.*/
#define LCD_SEG19_PORT                           GPIO_PC_INDEX /**< Port of SEG19.*/
#define LCD_SEG19_PIN                            9U            /**< Pin of SEG19.*/
#define LCD_SEG2_PORT                            GPIO_PC_INDEX /**< Port of SEG2.*/
#define LCD_SEG2_PIN                             2U            /**< Pin of SEG2.*/
#define LCD_SEG3_PORT                            GPIO_PC_INDEX /**< Port of SEG3.*/
#define LCD_SEG3_PIN                             3U            /**< Pin of SEG3.*/
#define LCD_SEG4_PORT                            GPIO_PC_INDEX /**< Port of SEG4.*/
#define LCD_SEG4_PIN                             4U            /**< Pin of SEG4.*/
#define LCD_SEG5_PORT                            GPIO_PC_INDEX /**< Port of SEG5.*/
#define LCD_SEG5_PIN                             5U            /**< Pin of SEG5.*/
#define LCD_SEG6_PORT                            GPIO_PC_INDEX /**< Port of SEG6.*/
#define LCD_SEG6_PIN                             6U            /**< Pin of SEG6.*/
#define LCD_SEG7_PORT                            GPIO_PC_INDEX /**< Port of SEG7.*/
#define LCD_SEG7_PIN                             7U            /**< Pin of SEG7.*/
#define LCD_SEG8_PORT                            GPIO_PA_INDEX /**< Port of SEG8.*/
#define LCD_SEG8_PIN                             0U            /**< Pin of SEG8.*/
#define LCD_SEG9_PORT                            GPIO_PA_INDEX /**< Port of SEG9.*/
#define LCD_SEG9_PIN                             1U            /**< Pin of SEG9.*/
#define LESENSE_EN_0_PORT                        GPIO_PA_INDEX /**< Port of EN_0.*/
#define LESENSE_EN_0_PIN                         3U            /**< Pin of EN_0.*/
#define LESENSE_EN_1_PORT                        GPIO_PA_INDEX /**< Port of EN_1.*/
#define LESENSE_EN_1_PIN                         4U            /**< Pin of EN_1.*/
#define LESENSE_EN_2_PORT                        GPIO_PA_INDEX /**< Port of EN_2.*/
#define LESENSE_EN_2_PIN                         5U            /**< Pin of EN_2.*/
#define LFXO_LFXTAL_I_PORT                       GPIO_PD_INDEX /**< Port of LFXTAL_I.*/
#define LFXO_LFXTAL_I_PIN                        1U            /**< Pin of LFXTAL_I.*/
#define LFXO_LFXTAL_O_PORT                       GPIO_PD_INDEX /**< Port of LFXTAL_O.*/
#define LFXO_LFXTAL_O_PIN                        0U            /**< Pin of LFXTAL_O.*/
#define LFXO_LF_EXTCLK_PORT                      GPIO_PD_INDEX /**< Port of LF_EXTCLK.*/
#define LFXO_LF_EXTCLK_PIN                       1U            /**< Pin of LF_EXTCLK.*/
#define VDAC0_CH0_MAIN_OUT_PORT                  GPIO_PB_INDEX /**< Port of CH0_MAIN_OUT.*/
#define VDAC0_CH0_MAIN_OUT_PIN                   0U            /**< Pin of CH0_MAIN_OUT.*/
#define VDAC0_CH1_MAIN_OUT_PORT                  GPIO_PB_INDEX /**< Port of CH1_MAIN_OUT.*/
#define VDAC0_CH1_MAIN_OUT_PIN                   1U            /**< Pin of CH1_MAIN_OUT.*/

